{
    "Annotatie": "Afgeleide non-STOP gegevens",
	"Instrument": "/akn/nl/act/gm9999/2022/REG_A",
    "Uitwisselingen": [{
			"UitgewisseldOp": "2022-01-01T08:31:57Z",
            "Doelen": ["/join/id/proces/gm9999/2022/Instelling"],
            "Beschrijving": "Initiële versie van de gegevens. Als voor synchronisatie op alleen <i>doel</i> gekozen wordt, dan zal het gaan om informatie die niet meeloopt met het STOP versiebeheer en dus op andere momenten uitgewisseld wordt. Dit voorbeeld laat zien (met <i>ex tunc</i> tijdreizen op tijdstip dat dat geen probleem is."
        }, {
			"UitgewisseldOp": "2022-05-01T19:14:18Z",
            "Doelen": ["/join/id/proces/gm9999/2022/WijzigingGelijktijdig1"],
            "Beschrijving": "Gegevens behorend bij het eerste van de twee gelijktijdig in werking tredende besluiten. Deze wordt als annotatieversie gebruikt totdat de gelijktijdige besluiten allebei in werking zijn getreden. Daarna zijn er twee annotatieversies voor dezelfde toestand en is niet duidelijk welke gekozen moet worden."
        }, {
			"UitgewisseldOp": "2022-05-02T07:05:34Z",
            "Doelen": ["/join/id/proces/gm9999/2022/WijzigingGelijktijdig2"],
            "Beschrijving": "Gegevens behorend bij het tweede van de twee gelijktijdig in werking tredende besluiten. Deze wordt nooit als annotatieversie gebruikt omdat de versie pas bekend is nadat de gelijktijdige besluiten allebei in werking zijn getreden. Er zijn dan twee annotatieversies voor dezelfde toestand en is niet duidelijk welke gekozen moet worden."
        }, {
			"UitgewisseldOp": "2022-05-03T16:59:30Z",
            "Doelen": ["/join/id/proces/gm9999/2022/WijzigingGelijktijdig1", "/join/id/proces/gm9999/2022/WijzigingGelijktijdig2"],
            "Beschrijving": "Gegevens voor de oplossing van de samenloop in de annotatie voor de twee versies die gelijktijdig in werking treden. Deze kan inhoudelijk verschillend zijn van de eerdere twee, maar dat hoeft niet."
        }, {
			"UitgewisseldOp": "2022-07-10T10:42:42Z",
            "Doelen": ["/join/id/proces/gm9999/2022/WijzigingTerugwerkend"],
            "Beschrijving": "Gegevens voor de laatste wijziging van de regeling. De annotatie is gegeven voor de actuele toestand die ontstaat vanwege dit doel, niet voor de toestanden die vanwege de terugwerekende kracht ontstaan. De gegevens worden uitgewisseld voordat de juridische informatie is uitgewisseld, maar komt pas in de tijdreis terug nadat de resulterende toestand is bepaald."
        }
    ]
}
